app/views/sections/show.html.erb

SELECT "entries".* FROM "entries" INNER JOIN "nests" ON "entries"."id" = "nests"."entry_id" WHERE "nests"."section_id" = ?  [["section_id", 1]]
---
      <h1><%= @section.name %></h1>
      <% @section.entries.each do |entry| %>