app/controllers/entries_controller.rb

INSERT INTO "entries" ("title", "link", "description", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdf"], ["link", "sadf"], ["description", "g"], ["rating", 2], ["created_at", "2015-09-15 20:38:06.641490"], ["updated_at", "2015-09-15 20:38:06.641490"]]
---
	def create
		@entry = Entry.new(entry_params)
  		if @entry.save