app/controllers/sections_controller.rb

	def show
		@section = Section.find(params[:id])
		@library = @section.category.library

		@entries_unread = Entry.unread_by(current_user)
		@entries_read = Entry.read_by(current_user)

		@entries_group_read = @section.entries.read.sort { |a, b| (b.get_likes.size-b.get_dislikes.size) <=> (a.get_likes.size-a.get_dislikes.size)}
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", 8]]
SELECT "categories".* FROM "categories"
SELECT "entries".* FROM "entries" INNER JOIN "nests" ON "entries"."id" = "nests"."entry_id" WHERE "nests"."section_id" = ?  [["section_id", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."category_id" = ?  [["category_id", 1]]